In [1]:
print("hello, world!")

hello, world!

## Data Types 
print("hello, world")

In [2]:
# a string is either double quotes "" or single quotes '' 
test="hello"

In [3]:
print(test)

hello

In [4]:
type(test)

str

In [6]:
# str stands for string as a type of variable. type is a function in python 
# numeric types come in two forms - integers and floats (R has other numeric types but python doesn't have these as the foundational numeric types)
# integer 
number = 10 
# float 
floaty = 5.4

In [7]:
number + floaty

15.4

In [8]:
test+number
# error because you can't add a number and string together, there's too many alternatives with not enough information provided

TypeError: can only concatenate str (not "int") to str

In [9]:
# adding two string types together gets them squished together - concatenation! 
test + test

'hellohello'

### Operators 
python understands basic mathematical operators (ie. -, +, /, *)

In [10]:
36/6
## python automatically outputs a float type of answer in response to code, even if it always only uses integers as this is computationally easier to output

6.0

In [11]:
## flawed division rounds answer to nearest integer 
15//4

3

In [12]:
##modulow checks whether a number is odd or even (0 shows even number, 1 shows odd number)
15 % 2

1

In [13]:
# concatenation with strings 
'foo' + 'bar'

'foobar'

In [14]:
'foo' - 'bar'
## doesn't know what to do.

TypeError: unsupported operand type(s) for -: 'str' and 'str'

In [15]:
##python will attempt to concatenate a string where they can e.g. 

'foo' * 10

'foofoofoofoofoofoofoofoofoofoo'

## python collections 
collections in python is the name given to data structures (e.g. vectors equivalent in R)
lists in python are more straight forward compared to R. 
when naming variables - convention is to always use lower case, no space and no colons

In [2]:
# lists in python
# = is an assignment character in python 
# anything within [] in python is a list - default. 
my_list = [1, '2', 3.2]
## a list is a way of storing multiple bits of data in python. The data is ordered and won't change unless you alter it. Will remain in this order.

In [3]:
print(my_list)

[1, '2', 3.2]

In [4]:
print(my_list[0])

1

In [5]:
## get the last item from a list 
print(my_list[-1])

3.2

In [6]:
## can get a subset of values from a list e.g. 
print(my_list[1:])
## this will bring all items apart from the first item of the list since item 1 is index 0. 
# get a view of a subset of lists - subsetting lists is good for tabular data.

['2', 3.2]

In [10]:
## a dictionary is a different data structure in python - not ordered intrinsically (different to list) works by having a key and an associated value with it. e.g 
## use the curly brackets to start a dictionary (not [] like for a list)
my_dict = {'one': 1, 'two': 3}
## the comma separates items within the dictionary data structure and the colon assigns the number value to a word

In [11]:
## the dictionary isn't ordered so doesn't understand the indexing function for index 0 for example. To index items in this data structure is to use the assigned keys
print(my_dict['one'])

1

In [12]:
## we can nest data together within dictionary keys - replicate a data frame from R using python dictionary e.g. assign a key as a column name and include all values within it. 
## dictionary is often quicker to use than index and keys are easier to understand and assign to items than remembering the index of an item

### importing the data 
there is already data in this folder - in the data folder. 
can use the unzip tool in the command line to import the data. One benefit of the notebook is that you can write the commands in the command line cells.

In [14]:
!ls
## need to include the ! which indicates the command you can run in the terminal.

LICENSE  README.md  assets  data  hello.iphynb	hello.ipynb

In [15]:
! unzip data/portal-teachingdb-master.zip

Archive:  data/portal-teachingdb-master.zip
   creating: portal-teachingdb-master/
  inflating: portal-teachingdb-master/surveys2001.csv
  inflating: portal-teachingdb-master/surveys2002.csv
  inflating: portal-teachingdb-master/speciesSubset.csv
  inflating: portal-teachingdb-master/bouldercreek_09_2013.txt
  inflating: portal-teachingdb-master/species.csv
  inflating: portal-teachingdb-master/surveys.csv
  inflating: portal-teachingdb-master/portal_mammals.sqlite
  inflating: portal-teachingdb-master/README.txt
  inflating: portal-teachingdb-master/plots.csv

In [16]:
## above code unzips the data folder (inserted in the repository) - see on the left panel.

In [17]:
##.csv is the classic data table format (before excel), where each line is a columns separated by commas. 
##there are different types of files within the data file so panda needs to understand each of these file types. 
## you can open each of the new files (which have appeared in the left hand panel) 
## can load a csv file with panda to get a dataframe.

### Installing packages in Python 
we have to import a package to be able to use it in python. For example,

 pandas package has already been installed with Pip install, but then you need to import it

In [18]:
import pandas

In [19]:
## aliasing pandas package for abbreviation 
import pandas as pd

In [20]:
## csv file to be read with pandas 
pd.read_csv("portal-teachingdb-master/surveys2001.csv")
## inside the brackets you provide a file path by copying a relative string

,Unnamed: 0,record_id,month,day,year,site_id,species_id,sex,hindfoot_length,weight
0,31710,31711,1,21,2001,1,PB,F,26.0,25.0
1,31711,31712,1,21,2001,1,DM,M,37.0,43.0
2,31712,31713,1,21,2001,1,PB,M,29.0,44.0
3,31713,31714,1,21,2001,1,DO,M,34.0,53.0
4,31714,31715,1,21,2001,2,OT,M,20.0,27.0
...,...,...,...,...,...,...,...,...,...,...
1429,33303,33304,12,15,2001,24,RM,M,16.0,10.0
1430,33304,33305,12,15,2001,7,PB,M,29.0,44.0
1431,33305,33306,12,15,2001,7,OT,M,19.0,21.0
1432,33306,33307,12,15,2001,7,OT,M,20.0,19.0
1433,33307,33308,12,15,2001,7,PP,M,24.0,16.0

In [21]:
pd.read_csv("portal-teachingdb-master/surveys.csv")

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN
...,...,...,...,...,...,...,...,...,...
35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

In [22]:
## need to assign this table to a variable in order to be able to use it within the notebook 
surveys_df = pd.read_csv("portal-teachingdb-master/surveys.csv")

In [23]:
surveys_df

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN
...,...,...,...,...,...,...,...,...,...
35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN